FreeRTOS/iot-reference-stm32u5/Projects/b_u585i_iot02a_ntz/Src/ota_pal/ota_pal_stm32u5_ntz.c
static inline uint32_t ulGetOtherBank( uint32_t ulBankNumber )
{
    uint32_t ulRevertBank;

    if( ulBankNumber == FLASH_BANK_2 )
    {
        ulRevertBank = FLASH_BANK_1;
    }
    else if( ulBankNumber == FLASH_BANK_1 )
    {
        ulRevertBank = FLASH_BANK_2;
    }
    else
    {
        ulRevertBank = 0;
    }

    return ulRevertBank;
}

static BaseType_t prvInitializePalContext( OtaPalContext_t * pxContext )
{
    BaseType_t xResult = pdTRUE;
    lfs_t * pxLfsCtx = NULL;

    configASSERT( pxContext != NULL );

    pxLfsCtx = pxGetDefaultFsCtx();

    if( pxLfsCtx == NULL )
    {
        LogError( "File system is not ready" );
        xResult = pdFALSE;
    }
    else
    {
        lfs_file_t xFile = { 0 };
        lfs_ssize_t xLfsErr = LFS_ERR_CORRUPT;

        pxContext->xPalState = OTA_PAL_READY;
        pxContext->ulTargetBank = 0;
        pxContext->ulBaseAddress = 0;
        pxContext->ulImageSize = 0;

        /* Open the file */
        xLfsErr = lfs_file_open( pxLfsCtx, &xFile, IMAGE_CONTEXT_FILE_NAME, LFS_O_RDONLY );

        if( xLfsErr != LFS_ERR_OK )
        {
            LogInfo( "OTA PAL NV context file not found. Using defaults." );
        }
        else
        {
            OtaPalNvContext_t xNvContext = { 0 };

            xLfsErr = lfs_file_read( pxLfsCtx, &xFile, &xNvContext, sizeof( OtaPalNvContext_t ) );

            if( xLfsErr != sizeof( OtaPalNvContext_t ) )
            {
                LogError( " Failed to read OTA image context from file: %s, rc: %d", IMAGE_CONTEXT_FILE_NAME, xLfsErr );
            }
            else
            {
                pxContext->xPalState = xNvContext.xPalState;
                pxContext->ulTargetBank = xNvContext.ulFileTargetBank;
                pxContext->ulBaseAddress = 0;
                pxContext->ulImageSize = 0;
            }

            ( void ) lfs_file_close( pxLfsCtx, &xFile );
        }
    }

    return xResult;
}

static BaseType_t prvWritePalNvContext( OtaPalContext_t * pxContext )
{
    BaseType_t xResult = pdTRUE;
    lfs_t * pxLfsCtx = pxGetDefaultFsCtx();

    configASSERT( pxContext != NULL );

    if( pxLfsCtx == NULL )
    {
        xResult = pdFALSE;
        LogError( "File system not ready." );
    }
    else
    {
        lfs_ssize_t xLfsErr = LFS_ERR_CORRUPT;
        lfs_file_t xFile = { 0 };
        OtaPalNvContext_t xNvContext;

        xNvContext.ulFileTargetBank = pxContext->ulTargetBank;
        xNvContext.xPalState = pxContext->xPalState;

        /* Open the file */
        xLfsErr = lfs_file_open( pxLfsCtx, &xFile, IMAGE_CONTEXT_FILE_NAME, ( LFS_O_WRONLY | LFS_O_CREAT | LFS_O_TRUNC ) );

        if( xLfsErr == LFS_ERR_OK )
        {
            xLfsErr = lfs_file_write( pxLfsCtx, &xFile, &xNvContext, sizeof( OtaPalNvContext_t ) );

            if( xLfsErr != sizeof( OtaPalNvContext_t ) )
            {
                LogError( "Failed to save OTA image context to file %s, error = %d.", IMAGE_CONTEXT_FILE_NAME, xLfsErr );
                xResult = pdFALSE;
            }

            ( void ) lfs_file_close( pxLfsCtx, &xFile );
        }
        else
        {
            LogError( "Failed to open file %s to save OTA image context, error = %d. ", IMAGE_CONTEXT_FILE_NAME, xLfsErr );
        }
    }

    return xResult;
}

static BaseType_t prvDeletePalNvContext( void )
{
    BaseType_t xResult = pdTRUE;
    lfs_t * pxLfsCtx = NULL;

    pxLfsCtx = pxGetDefaultFsCtx();

    if( pxLfsCtx == NULL )
    {
        xResult = pdFALSE;
        LogError( "File system not ready." );
    }
    else
    {
        struct lfs_info xFileInfo = { 0 };

        lfs_ssize_t xLfsErr = LFS_ERR_CORRUPT;

        xLfsErr = lfs_stat( pxLfsCtx, IMAGE_CONTEXT_FILE_NAME, &xFileInfo );

        if( xLfsErr == LFS_ERR_OK )
        {
            xLfsErr = lfs_remove( pxLfsCtx, IMAGE_CONTEXT_FILE_NAME );

            if( xLfsErr != LFS_ERR_OK )
            {
                xResult = pdFALSE;
            }
        }
    }

    return xResult;
}


static OtaPalContext_t * prvGetImageContext( void )
{
    OtaPalContext_t * pxCtx = NULL;

    if( xPalContext.xPalState == OTA_PAL_NOT_INITIALIZED )
    {
        if( prvInitializePalContext( &xPalContext ) == pdTRUE )
        {
            pxCtx = &xPalContext;
        }
    }
    else
    {
        pxCtx = &xPalContext;
    }

    return pxCtx;
}


static HAL_StatusTypeDef prvFlashSetDualBankMode( void )
{
    HAL_StatusTypeDef status = HAL_ERROR;
    FLASH_OBProgramInitTypeDef xObContext;

    /* Allow Access to Flash control registers and user Flash */
    status = HAL_FLASH_Unlock();

    if( status == HAL_OK )
    {
        /* Allow Access to option bytes sector */
        status = HAL_FLASH_OB_Unlock();

        if( status == HAL_OK )
        {
            /* Get the Dual bank configuration status */
            HAL_FLASHEx_OBGetConfig( &xObContext );

            if( ( xObContext.USERConfig & OB_DUALBANK_DUAL ) != OB_DUALBANK_DUAL )
            {
                xObContext.OptionType = OPTIONBYTE_USER;
                xObContext.USERType = OB_USER_DUALBANK;
                xObContext.USERConfig = OB_DUALBANK_DUAL;
                status = HAL_FLASHEx_OBProgram( &xObContext );
            }

            ( void ) HAL_FLASH_OB_Lock();
        }

        ( void ) HAL_FLASH_Lock();
    }

    return status;
}

static BaseType_t prvSelectBank( uint32_t ulNewBank )
{
    FLASH_OBProgramInitTypeDef xObContext = { 0 };
    BaseType_t xResult = pdTRUE;

    /* Validate selected bank */
    if( ( ulNewBank != FLASH_BANK_1 ) &&
        ( ulNewBank != FLASH_BANK_2 ) )
    {
        xResult = pdFALSE;
    }
    else if( prvGetBankSettingFromOB() != ulNewBank )
    {
        HAL_StatusTypeDef xHalStatus = HAL_ERROR;

        /* Allow Access to Flash control registers and user Flash */
        xHalStatus = HAL_FLASH_Unlock();

        if( xHalStatus != HAL_OK )
        {
            /* Lock on error */
            ( void ) HAL_FLASH_Lock();
        }
        else /* xHalStatus == HAL_OK */
        {
            /* Allow Access to option bytes sector */
            xHalStatus = HAL_FLASH_OB_Unlock();

            if( xHalStatus != HAL_OK )
            {
                /* Lock on error */
                ( void ) HAL_FLASH_Lock();
            }
        }

        if( xHalStatus == HAL_OK )
        {
            /* Get the SWAP_BANK status */
            HAL_FLASHEx_OBGetConfig( &xObContext );

            xObContext.OptionType = OPTIONBYTE_USER;
            xObContext.USERType = OB_USER_SWAP_BANK;

            if( ulNewBank == FLASH_BANK_2 )
            {
                xObContext.USERConfig = OB_SWAP_BANK_ENABLE;
            }
            else /* ulNewBank == FLASH_BANK_1  */
            {
                xObContext.USERConfig = OB_SWAP_BANK_DISABLE;
            }

