FreeRTOS/iot-reference-stm32u5/Projects/b_u585i_iot02a_ntz/Src/ota_pal/ota_pal_stm32u5_ntz.c
    PkiObject_t xOtaSigningPubKey;
    mbedtls_pk_context xPubKeyCtx;

    configASSERT( pcPubKeyLabel != NULL );
    configASSERT( pucSignature != NULL );
    configASSERT( uxSignatureLength > 0 );
    configASSERT( pucImageHash != NULL );
    configASSERT( uxHashLength > 0 );

    mbedtls_pk_init( &xPubKeyCtx );

    xOtaSigningPubKey = xPkiObjectFromLabel( pcPubKeyLabel );

    if( xPkiReadPublicKey( &xPubKeyCtx, &xOtaSigningPubKey ) != PKI_SUCCESS )
    {
        LogError( "Failed to load OTA Signing public key." );
        uxStatus = OTA_PAL_COMBINE_ERR( OtaPalBadSignerCert, 0 );
    }

    /* Verify the provided signature against the image hash */
    if( OTA_PAL_MAIN_ERR( uxStatus ) == OtaPalSuccess )
    {
        int lRslt = mbedtls_pk_verify( &xPubKeyCtx, MBEDTLS_MD_SHA256,
                                       pucImageHash, uxHashLength,
                                       pucSignature, uxSignatureLength );

        if( lRslt != 0 )
        {
            MBEDTLS_MSG_IF_ERROR( lRslt, "OTA Image signature verification failed." );
            uxStatus = OTA_PAL_COMBINE_ERR( OtaPalSignatureCheckFailed, lRslt );
        }
    }

    mbedtls_pk_free( &xPubKeyCtx );

    return uxStatus;
}

OtaPalStatus_t otaPal_CreateFileForRx( OtaFileContext_t * const pxFileContext )
{
    OtaPalStatus_t uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
    OtaPalContext_t * pxContext = prvGetImageContext();

    /* Handle back to back updates */
    if( ( pxContext->xPalState == OTA_PAL_ACCEPTED ) ||
        ( pxContext->xPalState == OTA_PAL_REJECTED ) )
    {
        pxContext->xPalState = OTA_PAL_READY;
    }

    LogInfo( "CreateFileForRx: xPalState: %s", pcPalStateToString( pxContext->xPalState ) );

    if( ( pxFileContext->fileSize > FLASH_BANK_SIZE ) ||
        ( pxFileContext->fileSize < OTA_IMAGE_MIN_SIZE ) )
    {
        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileTooLarge, 0 );
    }
    else if( strncmp( "b_u585i_iot02a_ntz.bin", ( char * ) pxFileContext->pFilePath, pxFileContext->filePathMaxSize ) != 0 )
    {
        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
    }
    else if( ( pxContext == NULL ) ||
             ( pxContext->xPalState != OTA_PAL_READY ) )
    {
        LogError( "OTA PAL context is NULL or not in the OTA_PAL_READY state." );
        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
    }
    else
    {
        uint32_t ulTargetBank = 0UL;

        /* Set dual bank mode if not already set. */
        if( prvFlashSetDualBankMode() != HAL_OK )
        {
            uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
        }

        if( OTA_PAL_MAIN_ERR( uxOtaStatus ) == OtaPalSuccess )
        {
            ulTargetBank = prvGetInactiveBank();

            if( ulTargetBank == 0UL )
            {
                uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
            }
        }

        if( ( OTA_PAL_MAIN_ERR( uxOtaStatus ) == OtaPalSuccess ) &&
            ( prvEraseBank( ulTargetBank ) != pdTRUE ) )
        {
            uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
        }

        if( OTA_PAL_MAIN_ERR( uxOtaStatus ) == OtaPalSuccess )
        {
            pxContext->ulTargetBank = ulTargetBank;
            pxContext->ulPendingBank = prvGetActiveBank();
            pxContext->ulBaseAddress = FLASH_START_INACTIVE_BANK;
            pxContext->ulImageSize = pxFileContext->fileSize;
            pxContext->xPalState = OTA_PAL_FILE_OPEN;
            pxFileContext->pFile = pxContext;
        }

        if( OTA_PAL_MAIN_ERR( uxOtaStatus ) == OtaPalSuccess )
        {
            if( prvDeletePalNvContext() == pdFALSE )
            {
                uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalBootInfoCreateFailed, 0 );
            }
        }
    }

    return uxOtaStatus;
}

int16_t otaPal_WriteBlock( OtaFileContext_t * const pxFileContext,
                           uint32_t offset,
                           uint8_t * const pData,
                           uint32_t blockSize )
{
    int16_t sBytesWritten = -1;
    OtaPalContext_t * pxContext = prvGetImageContext();

    configASSERT( pxContext->ulTargetBank != prvGetActiveBank() );

    configASSERT( blockSize < INT16_MAX );

    if( ( pxFileContext == NULL ) ||
        ( pxFileContext->pFile != ( uint8_t * ) ( pxContext ) ) )
    {
        LogError( "File context is invalid." );
    }
    else if( pxContext == NULL )
    {
        LogError( "PAL context is invalid." );
    }
    else if( ( offset + blockSize ) > pxContext->ulImageSize )
    {
        LogError( "Offset and blockSize exceeds image size" );
    }
    else if( pxContext->xPalState != OTA_PAL_FILE_OPEN )
    {
        LogError( "Invalid PAL State. otaPal_WriteBlock may only occur when file is open." );
    }
    else if( pData == NULL )
    {
        LogError( "pData is NULL." );
    }
    else if( prvWriteToFlash( ( pxContext->ulBaseAddress + offset ), pData, blockSize ) == HAL_OK )
    {
        sBytesWritten = ( int16_t ) blockSize;
    }

    return sBytesWritten;
}

OtaPalStatus_t otaPal_CloseFile( OtaFileContext_t * const pxFileContext )
{
    OtaPalStatus_t uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );

    OtaPalContext_t * pxContext = prvGetImageContext();

    configASSERT( pxFileContext );
    configASSERT( pxContext );
    configASSERT( pxFileContext->pSignature );

    if( ( pxFileContext->pFile == ( uint8_t * ) ( pxContext ) ) &&
        ( pxContext->xPalState == OTA_PAL_FILE_OPEN ) )

    {
        unsigned char pucHashBuffer[ MBEDTLS_MD_MAX_SIZE ];
        size_t uxHashLength = 0;

        if( xCalculateImageHash( ( unsigned char * ) ( pxContext->ulBaseAddress ),
                                 ( size_t ) pxContext->ulImageSize,
                                 pucHashBuffer, MBEDTLS_MD_MAX_SIZE, &uxHashLength ) != pdTRUE )
        {
            uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalFileClose, 0 );
        }

        if( OTA_PAL_MAIN_ERR( uxOtaStatus ) == OtaPalSuccess )
        {
            uxOtaStatus = prvValidateSignature( ( char * ) pxFileContext->pCertFilepath,
                                                pxFileContext->pSignature->data,
                                                pxFileContext->pSignature->size,
                                                pucHashBuffer,
                                                uxHashLength );
        }

        if( OTA_PAL_MAIN_ERR( uxOtaStatus ) == OtaPalSuccess )
        {
            pxContext->xPalState = OTA_PAL_PENDING_ACTIVATION;
        }
        else
        {
            otaPal_SetPlatformImageState( pxFileContext, OtaImageStateRejected );
        }
    }
    else if( pxFileContext == NULL )
    {
        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalNullFileContext, 0 );
    }
    else
    {
        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalFileClose, 0 );
    }

    return uxOtaStatus;
}


OtaPalStatus_t otaPal_Abort( OtaFileContext_t * const pxFileContext )
{
    return otaPal_SetPlatformImageState( pxFileContext, OtaImageStateAborted );
}

OtaPalStatus_t otaPal_ActivateNewImage( OtaFileContext_t * const pxFileContext )
{
    OtaPalStatus_t uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalActivateFailed, 0 );

    OtaPalContext_t * pxContext = prvGetImageContext();

    LogInfo( "ActivateNewImage xPalState: %s", pcPalStateToString( pxContext->xPalState ) );

    if( ( pxContext != NULL ) &&
        ( pxContext->xPalState == OTA_PAL_PENDING_ACTIVATION ) )
    {
        pxContext->ulPendingBank = pxContext->ulTargetBank;

        pxContext->xPalState = OTA_PAL_PENDING_SELF_TEST;
        uxOtaStatus = otaPal_ResetDevice( pxFileContext );
    }

    return uxOtaStatus;
}

void otaPal_EarlyInit( void )
{
    OtaPalContext_t * pxCtx = prvGetImageContext();

    ( void ) prvGetActiveBank();

    /* Check that context is valid */
    if( pxCtx != NULL )
    {
        LogSys( "OTA EarlyInit: State: %s, Current Bank: %d, Target Bank: %d.", pcPalStateToString( pxCtx->xPalState ), prvGetActiveBank(), pxCtx->ulTargetBank );

        switch( pxCtx->xPalState )
        {
            case OTA_PAL_PENDING_SELF_TEST:
                configASSERT( pxCtx->ulTargetBank == prvGetActiveBank() );

                /* Update the state to show that the new image was booted successfully */
                pxCtx->xPalState = OTA_PAL_NEW_IMAGE_BOOTED;
                ( void ) prvWritePalNvContext( pxCtx );
                break;

