FreeRTOS/iot-reference-stm32u5/Projects/b_u585i_iot02a_ntz/Src/ota_pal/ota_pal_stm32u5_ntz.c
            case OTA_PAL_NEW_IMAGE_BOOTED:
                pxCtx->xPalState = OTA_PAL_NEW_IMAGE_WDT_RESET;
                pxCtx->ulPendingBank = ulGetOtherBank( pxCtx->ulTargetBank );
                ( void ) prvWritePalNvContext( pxCtx );

                LogError( "Detected a watchdog reset during first boot of new image. Reverting to bank: %d", ulGetOtherBank( pxCtx->ulTargetBank ) );
                ( void ) otaPal_ResetDevice( NULL );
                break;

            case OTA_PAL_NEW_IMAGE_WDT_RESET:
            case OTA_PAL_SELF_TEST_FAILED:
                pxCtx->xPalState = OTA_PAL_REJECTED;
                ( void ) prvDeletePalNvContext();
                ( void ) prvEraseBank( pxCtx->ulTargetBank );
                break;

            default:
                break;
        }

        LogSys( "OTA EarlyInit: Ending State: %s.", pcPalStateToString( pxCtx->xPalState ) );
    }
}

OtaPalStatus_t otaPal_SetPlatformImageState( OtaFileContext_t * const pxFileContext,
                                             OtaImageState_t xDesiredState )
{
    OtaPalStatus_t uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalBadImageState, 0 );

    OtaPalContext_t * pxContext = prvGetImageContext();

    LogInfo( "SetPlatformImageState: %s, %s", otaImageStateToString( xDesiredState ), pcPalStateToString( pxContext->xPalState ) );

    ( void ) pxFileContext;

    if( pxContext != NULL )
    {
        switch( xDesiredState )
        {
            case OtaImageStateAccepted:

                switch( pxContext->xPalState )
                {
                    case OTA_PAL_NEW_IMAGE_BOOTED:
                        configASSERT( prvGetActiveBank() == pxContext->ulTargetBank );
                        pxContext->ulPendingBank = pxContext->ulTargetBank;

                        /* Delete context from flash */
                        if( prvDeletePalNvContext() == pdTRUE )
                        {
                            uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
                            pxContext->xPalState = OTA_PAL_ACCEPTED;
                        }
                        else
                        {
                            uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalCommitFailed, 0 );
                            LogError( "Failed to delete NV context file." );
                        }

                        break;

                    case OTA_PAL_ACCEPTED:
                        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
                        break;

                    default:
                        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalCommitFailed, 0 );
                        break;
                }

                break;

            case OtaImageStateRejected:

                switch( pxContext->xPalState )
                {
                    /* Handle self-test or version check failure */
                    case OTA_PAL_PENDING_SELF_TEST:
                    case OTA_PAL_NEW_IMAGE_BOOTED:
                        pxContext->xPalState = OTA_PAL_SELF_TEST_FAILED;
                        pxContext->ulPendingBank = ulGetOtherBank( pxContext->ulTargetBank );
                        uxOtaStatus = otaPal_ResetDevice( pxFileContext );
                        break;

                    case OTA_PAL_SELF_TEST_FAILED:
                        configASSERT( prvGetActiveBank() == ulGetOtherBank( pxContext->ulTargetBank ) );

                        if( ( prvEraseBank( pxContext->ulTargetBank ) == pdTRUE ) &&
                            ( prvDeletePalNvContext() == pdTRUE ) )
                        {
                            uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
                            pxContext->xPalState = OTA_PAL_REJECTED;
                        }

                        break;

                    /* Handle failed verification */
                    case OTA_PAL_PENDING_ACTIVATION:
                    case OTA_PAL_FILE_OPEN:
                        pxContext->ulPendingBank = ulGetOtherBank( pxContext->ulTargetBank );

                        if( ( prvEraseBank( pxContext->ulTargetBank ) == pdTRUE ) &&
                            ( prvDeletePalNvContext() == pdTRUE ) )
                        {
                            uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
                            pxContext->xPalState = OTA_PAL_REJECTED;
                        }

                        break;

                    case OTA_PAL_NEW_IMAGE_WDT_RESET:
                    case OTA_PAL_REJECTED:
                        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
                        break;

                    default:
                        break;
                }

                break;

            case OtaImageStateTesting:

                switch( pxContext->xPalState )
                {
                    case OTA_PAL_NEW_IMAGE_BOOTED:
                        configASSERT( prvGetActiveBank() == pxContext->ulTargetBank );
                        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
                        break;

                    case OTA_PAL_PENDING_SELF_TEST:
                        configASSERT( prvGetActiveBank() == ulGetOtherBank( pxContext->ulTargetBank ) );
                        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalBadImageState, 0 );
                        break;

                    default:
                        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalBadImageState, 0 );
                        break;
                }

                break;

            case OtaImageStateAborted:

                switch( pxContext->xPalState )
                {
                    case OTA_PAL_READY:
                    case OTA_PAL_REJECTED:
                    case OTA_PAL_ACCEPTED:
                        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
                        break;

                    case OTA_PAL_SELF_TEST_FAILED:
                        configASSERT( prvGetActiveBank() == ulGetOtherBank( pxContext->ulTargetBank ) );
                        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
                        break;

