FreeRTOS/iot-reference-stm32u5/Projects/b_u585i_iot02a_ntz/Src/ota_pal/ota_pal_stm32u5_ntz.c
                    case OTA_PAL_NEW_IMAGE_BOOTED:
                        configASSERT( prvGetActiveBank() == pxContext->ulTargetBank );
                        pxContext->ulPendingBank = ulGetOtherBank( pxContext->ulTargetBank );
                        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
                        break;

                    /* Handle abort and clear flash / nv context */
                    case OTA_PAL_FILE_OPEN:
                    case OTA_PAL_PENDING_ACTIVATION:
                    case OTA_PAL_PENDING_SELF_TEST:
                    case OTA_PAL_NEW_IMAGE_WDT_RESET:
                        configASSERT( prvGetActiveBank() == ulGetOtherBank( pxContext->ulTargetBank ) );

                        /* Clear any pending bank swap */
                        pxContext->ulPendingBank = prvGetActiveBank();

                        if( ( prvEraseBank( pxContext->ulTargetBank ) == pdTRUE ) &&
                            ( prvDeletePalNvContext() == pdTRUE ) )
                        {
                            uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
                            pxContext->xPalState = OTA_PAL_READY;
                        }
                        else
                        {
                            LogError( "Failed to erase inactive bank." );
                            uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalBadImageState, 0 );
                        }

                        break;

                    default:
                        break;
                }

                break;

            default:
                pxContext->xPalState = OTA_PAL_INVALID;
                break;
        }
    }

    return uxOtaStatus;
}


OtaPalImageState_t otaPal_GetPlatformImageState( OtaFileContext_t * const pxFileContext )
{
    OtaPalImageState_t xOtaState = OtaPalImageStateUnknown;
    OtaPalContext_t * pxContext = prvGetImageContext();

    ( void ) pxFileContext;

    configASSERT( pxFileContext );

    if( pxContext != NULL )
    {
        switch( pxContext->xPalState )
        {
            case OTA_PAL_NOT_INITIALIZED:
            case OTA_PAL_INVALID:
            default:
                xOtaState = OtaPalImageStateUnknown;
                break;

            case OTA_PAL_READY:
            case OTA_PAL_FILE_OPEN:
            case OTA_PAL_REJECTED:
            case OTA_PAL_NEW_IMAGE_WDT_RESET:
            case OTA_PAL_SELF_TEST_FAILED:
                xOtaState = OtaPalImageStateInvalid;
                break;

            case OTA_PAL_PENDING_ACTIVATION:
            case OTA_PAL_PENDING_SELF_TEST:
            case OTA_PAL_NEW_IMAGE_BOOTED:
                xOtaState = OtaPalImageStatePendingCommit;
                break;

            case OTA_PAL_ACCEPTED:
                xOtaState = OtaPalImageStateValid;
                break;
        }

        LogInfo( "GetPlatformImageState: %s: %s", otaPalImageStateToString( xOtaState ), pcPalStateToString( pxContext->xPalState ) );
    }

    return xOtaState;
}


OtaPalStatus_t otaPal_ResetDevice( OtaFileContext_t * const pxFileContext )
{
    OtaPalStatus_t uxStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );

    ( void ) pxFileContext;
    OtaPalContext_t * pxContext = prvGetImageContext();

    LogSys( "OTA PAL reset request received. xPalState: %s", pcPalStateToString( pxContext->xPalState ) );

    if( pxContext != NULL )
    {
        /* Determine if context needs to be saved or deleted */
        switch( pxContext->xPalState )
        {
            /* A Reset during OTA_PAL_NEW_IMAGE_BOOTED means that the self test has failed */
            case OTA_PAL_NEW_IMAGE_BOOTED:
                configASSERT( prvGetActiveBank() == pxContext->ulTargetBank );


                pxContext->xPalState = OTA_PAL_SELF_TEST_FAILED;

                if( prvWritePalNvContext( pxContext ) != pdTRUE )
                {
                    LogError( "Failed to write to NV context." );
                    uxStatus = OTA_PAL_COMBINE_ERR( OtaPalRejectFailed, 0 );
                }

                pxContext->ulPendingBank = ulGetOtherBank( pxContext->ulTargetBank );
                break;

            /* Need to reset and start self test */
            case OTA_PAL_PENDING_SELF_TEST:
                configASSERT( prvGetActiveBank() == ulGetOtherBank( pxContext->ulTargetBank ) );

                pxContext->ulPendingBank = pxContext->ulTargetBank;

                if( prvWritePalNvContext( pxContext ) != pdTRUE )
                {
                    LogError( "Failed to write to NV context." );
                    uxStatus = OTA_PAL_COMBINE_ERR( OtaPalActivateFailed, 0 );
                }

                break;

            case OTA_PAL_NEW_IMAGE_WDT_RESET:
                break;

            case OTA_PAL_SELF_TEST_FAILED:
                configASSERT( prvGetActiveBank() == ulGetOtherBank( pxContext->ulTargetBank ) );

                if( prvDeletePalNvContext() == pdFALSE )
                {
                    uxStatus = OTA_PAL_COMBINE_ERR( OtaPalActivateFailed, 0 );
                }

                break;

            case OTA_PAL_READY:
            case OTA_PAL_FILE_OPEN:
            case OTA_PAL_PENDING_ACTIVATION:
                configASSERT( prvGetActiveBank() == ulGetOtherBank( pxContext->ulTargetBank ) );

            default:
            case OTA_PAL_NOT_INITIALIZED:
                pxContext->ulPendingBank = ulGetOtherBank( pxContext->ulTargetBank );
                break;
        }

        if( ( pxContext->ulPendingBank != 0 ) &&
            ( pxContext->ulPendingBank != prvGetActiveBank() ) )
        {
            LogSys( "Selecting Bank #%d.", pxContext->ulPendingBank );

            if( prvSelectBank( pxContext->ulPendingBank ) == pdTRUE )
            {
                prvOptionByteApply();
            }
            else
            {
                LogError( "Failed to select bank." );
                uxStatus = OTA_PAL_COMBINE_ERR( OtaPalUninitialized, 0 );
            }
        }
    }

    if( OTA_PAL_MAIN_ERR( uxStatus ) == OtaPalSuccess )
    {
        vDoSystemReset();

        LogError( "System reset failed" );

        uxStatus = OTA_PAL_COMBINE_ERR( OtaPalUninitialized, 0 );
    }

    return uxStatus;
}
